In [5]:
 %load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# Introduction

Movies are one of the most widely databases used for exploratory analysis as it provides plenty of paths for its exploration. 
Five SQL tables have been generated, called: **tb_movie, tb_genre, tb_person, tb_role** and **tb_movie_person**. These five tables are intercconected with each other *via* a key.

## Exploratory analysis of the data

The database is made of differents data, with different columns where data is stored.

### **tb_movie**

In [35]:
%%sql

SELECT * FROM tb_movie

 * sqlite://
Done.

[(1, 'Apocalypse Now', '1979-05-10', 'Film', 11, 'OS_SGAD', None, None),
 (2, 'Star Wars:Episode IV - A New Hope', '1977-05-25', 'Film', 2, 'OS_SGAD', None, None),
 (3, 'Indiana Jones and the Temple of Doom', '1984-05-08', 'Film', 1, 'OS_SGAD', None, None),
 (4, 'The Terminal', '2004-06-18', 'Digital', 3, 'OS_SGAD', None, None),
 (5, 'Jaws', '1975-01-01', 'Film', 10, 'OS_SGAD', None, None),
 (6, 'ET The Extraterrestrial', '1982-07-25', 'Film', 5, 'OS_SGAD', None, None),
 (7, 'Psycho', '1960-05-06', 'Film', 9, 'OS_SGAD', None, None),
 (8, 'Ocho Apellidos Vascos', '2014-03-14', 'Digital', 3, 'OS_SGAD', None, None),
 (9, 'Ocho Apellidos Catalanes', '2016-06-09', 'Digital', 8, 'OS_SGAD', None, None),
 (10, 'El otro lado de la cama', '2002-09-04', 'Digital', 8, 'OS_SGAD', None, None),
 (11, 'La Gran Familia Española', '2012-10-15', 'Digital', 3, 'OS_SGAD', None, None),
 (12, 'El dia de la bestia', '1994-12-25', 'Film', 1, 'OS_SGAD', None, None),
 (13, 'Braveheart', '1995-08-08', 'Film', 4, 'OS_SGAD', None, None),
 (14, 'The Shawshank Redemption', '1992-01-07', 'Film', 4, 'OS_SGAD', None, None),
 (15, 'Las brujas de Zugarramurdi', '2009-10-07', 'Digital', 9, 'OS_SGAD', None, None),
 (16, 'Blade Runner', '1982-12-25', 'Digital', 2, 'OS_SGAD', None, None)]

The table consists of 16 rows i.e., 16 movies, and 8 columns with its attributes being:
1. *movie_id*: ID of the movie, from 1 to 16, which is linked to the **tb_movie_person** table.  TYPE: INTEGER NOT NULL. CONSTRAINT: PRIMARY KEY
2. *movie_title*: Title of the movie.  *Note that the titles are in Spanish*. 
    TYPE: CHARACTER VARYING(100) NOT NULL.  
3. *movie_date* : Premiere date. TYPE: DATE.
4. *movie_format* : Film or Digital format. TYPE: CHARACTER VARYING(50). 
5. *movie_genre_id*: the id of the movie genre.
    TYPE: INTEGER. CONSTRAINT: FOREIGN KEY. REFERENCES: tb_genre (genre_id).
6. *created_by_user*: Who created the data. TYPE: CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD'. 
7. *created_date*: When the user created the data. TYPE: DATE.
8. *data_update*: Whether the data has been updated or not. TYPE: DATE.

### **tb_genre**

In [36]:
%%sql

SELECT * FROM tb_genre

 * sqlite://
Done.

[(1, 'Acción', 'OS_SGAD', None, None),
 (2, 'Ciencia Ficción', 'OS_SGAD', None, None),
 (3, 'Comedia', 'OS_SGAD', None, None),
 (4, 'Drama', 'OS_SGAD', None, None),
 (5, 'Fantasía', 'apermag', None, None),
 (6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27'),
 (7, 'Musical', 'OS_SGAD', None, None),
 (8, 'Romance', 'OS_SGAD', None, None),
 (9, 'Suspense', 'OS_SGAD', None, None),
 (10, 'Terror', 'OS_SGAD', None, None),
 (11, 'Bélico', 'OS_SGAD', None, None)]

The table consists of 11 rows i.e., 11 different movies genres, and 5 columns with its attributes being: 
1. *genre_id*: The id of the genre, from 1 to 11, which is linked to the **tb_movie** table. TYPE: INTEGER NOT NULL. CONSTRAINT: PRIMARY KEY
2. *genre_name*: The name of the genre, such as Acción, Romance or Terror. *Note that the names are in Spanish*. TYPE: CHARACTER VARYING(40) NOT NULL.
3. *created_by_user*: Who created the data. TYPE: CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD'.
4. *created_date*: When the user created the data. TYPE: DATE.
5. *data_update*: Whether the data has been updated or not. TYPE: DATE.

### **tb_person**

In [97]:
%%sql

SELECT * FROM tb_person LIMIT 10

 * sqlite://
Done.

[(1, 'Francis Ford Coppola', 'United States', '1939-04-07', None, None, 'OS_SGAD', None, None),
 (2, 'Carmine Coppola', 'United States', '1945-07-08', None, None, 'OS_SGAD', None, None),
 (3, 'Marlon Brando', 'United States', '1924-04-03', '2004-07-01', None, 'OS_SGAD', None, None),
 (4, 'Robert Duvall', 'United States', '1931-01-05', None, None, 'OS_SGAD', None, None),
 (5, 'Martin Sheen', 'United States', '1940-08-03', None, None, 'OS_SGAD', None, None),
 (6, 'Harrison Ford', 'United States', '1942-07-13', None, None, 'OS_SGAD', None, None),
 (7, 'George Lucas', 'United States', '1944-05-14', None, None, 'OS_SGAD', None, None),
 (8, 'Gary Kurtz', 'United States', '1940-07-27', None, None, 'OS_SGAD', None, None),
 (9, 'Steven Spielberg', 'United States', '1946-12-18', None, None, 'OS_SGAD', None, None),
 (10, 'John Williams', 'United States', '1928-08-08', None, None, 'OS_SGAD', None, None)]

The table consists of 52 rows (only 10 are shown) i.e., 52 persons, and 9 columns with its attributes being: 

1. *person_id*: ID of the person, from 1 to 52, which is linked to the **tb_movie_person** table. TYPE: INTEGER NOT NULL. CONSTRAINT: PRIMARY KEY. 
2. *person_name*:  Full name of the person. 
3. *person_country*: The country where was born. 
4. *person_dob*: The date when was born. 
5. *person_dod*: The date of death. Note that most of the people in the table are still alive. 
6. *person_parent_id*: ID of the parent. TYPE: INTEGER. CONSTRAINT: FOREIGN KEY REFERENCES tb_person (person_id). TYPE: INTEGER
7. *created_by_user*: Who created the data. TYPE: CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD'. 
8. *created_date*: When the user created the data. TYPE: DATE.
9. *data_update*: Whether the data has been updated or not. TYPE: DATE.

### **tb_role**

In [41]:
%%sql

SELECT * FROM tb_role

 * sqlite://
Done.

[(1, 'Actor', 'OS_SGAD', None, None),
 (2, 'Director', 'OS_SGAD', None, None),
 (3, 'Productor', 'OS_SGAD', None, None),
 (4, 'Guionista', 'OS_SGAD', None, None),
 (5, 'Música', 'OS_SGAD', None, None)]

The table consist of 5 rows, i.e., 5 different roles, and 5 columns. 
1. *role_id*: ID identifying the different role.  This column is linked to the **tb_movie_person** table. TYPE: INTEGER NOT NULL. CONSTRAINT: PRIMARY KEY
2. *role_name*: Name of the different roles. TYPE: CHARACTER VARYING(60) NOT NULL
3. *created_by_user*: Who created the data. TYPE: CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD'. 
4. *created_date*: When the user created the data. TYPE: DATE.
5. *data_update*: Whether the data has been updated or not. TYPE: DATE.

### **tb_movie_person**

In [44]:
%%sql

SELECT * FROM tb_movie_person LIMIT 10

 * sqlite://
Done.

[(1, 1, 2, 'Y', 'OS_SGAD', None, None),
 (1, 1, 3, 'N', 'OS_SGAD', None, None),
 (1, 1, 5, 'N', 'OS_SGAD', None, None),
 (1, 2, 5, 'N', 'OS_SGAD', None, None),
 (1, 3, 1, 'N', 'OS_SGAD', None, None),
 (1, 4, 1, 'N', 'OS_SGAD', None, None),
 (1, 5, 1, 'Y', 'OS_SGAD', None, None),
 (1, 41, 1, 'N', 'OS_SGAD', None, None),
 (1, 6, 1, 'N', 'OS_SGAD', None, None),
 (2, 6, 1, 'N', 'OS_SGAD', None, None)]

This is the main table, which acts as the connector with the rest of the tables. It consists of 50 rows and 7 columns. 

1. *movie_id*: ID of the movie. It is linked to the **tb_movie** table. TYPE: INTEGER NOT NULL. CONSTRAINT: PRIMARY KEY AND FOREIGN KEY,  REFERENCES tb_movie (movie_id). 
2. *person_id*: ID of the person. TYPE: INTEGER NOT NULL. CONSTRAINT: PRIMARY KEY AND FOREIGN KEY,  REFERENCES tb_person (person_id).
3. *role_id*: ID of the role. TYPE: INTEGER NOT NULL. CONSTRAINT: PRIMARY KEY AND FOREIGN KEY,  REFERENCES tb_role (role_id).
4. *movie_award_Ind*: Whether the movie has been awarded (Y:Yes) or not (N: No). TYPE: CHAR(1) NOT NULL.
5. *created_by_user*: Who created the data. TYPE: CHARACTER VARYING(10) NOT NULL DEFAULT 'OS_SGAD'. 
6. *created_date*: When the user created the data. TYPE: DATE.
7. *data_update*: Whether the data has been updated or not. TYPE: DATE.

## Who is still alive?

Let's try to figure out the name, country and date of birth of the persons who are still alive.

In [45]:
%%sql

SELECT person_name, person_country, person_dob
FROM tb_person
WHERE person_dod IS NULL
ORDER BY person_dob ASC

 * sqlite://
Done.

[('John Williams', 'United States', '1928-08-08'),
 ('Vera Miles', 'United States', '1929-08-23'),
 ('Sean Connery', 'Scotland', '1930-07-08'),
 ('Robert Duvall', 'United States', '1931-01-05'),
 ('Morgan Freeman', 'United States', '1935-10-01'),
 ('Francis Ford Coppola', 'United States', '1939-04-07'),
 ('Gary Kurtz', 'United States', '1940-07-27'),
 ('Martin Sheen', 'United States', '1940-08-03'),
 ('Harrison Ford', 'United States', '1942-07-13'),
 ('George Lucas', 'United States', '1944-05-14'),
 ('Carmine Coppola', 'United States', '1945-07-08'),
 ('Steven Spielberg', 'United States', '1946-12-18'),
 ('Tim Robbins', 'United States', '1949-06-07'),
 ('Mel Gibson', 'Australia', '1950-08-09'),
 ('Tom Hanks', 'United States', '1956-07-09'),
 ('Emilio Martinez Lazaro', 'Spain', '1956-09-09'),
 ('Karra Elejalde', 'Spain', '1960-03-06'),
 ('Emilio Estevez', 'United States', '1962-05-12'),
 ('Ramón Estevez', 'United States', '1963-08-07'),
 ('Carmen Machi', 'Spain', '1964-08-09'),
 ('Charlie Sheen', 'United States', '1965-09-03'),
 ('Reneé Estevez', 'United States', '1967-04-02'),
 ('Catherine Zeta-Jones', 'Wales', '1969-09-25'),
 ('Robert Alamo', 'Spain', '1970-05-06'),
 ('Daniel Sanchez Arevalo', 'Spain', '1970-06-08'),
 ('Quim Gutierrez', 'Spain', '1981-03-27'),
 ('Veronica Echegui', 'Spain', '1983-03-14'),
 ('Taylor Levi Estevez', 'United States', '1984-06-22'),
 ('Dani Rovira', 'Spain', '1984-07-01'),
 ('Paula Speert Sheen', 'United States', '1986-01-06'),
 ('Paloma Rae Estevez', 'United States', '1986-02-15'),
 ('Clara Lago', 'Spain', '1986-04-17'),
 ('Patrick Criado', 'Spain', '1995-09-23'),
 ('Paula Jones-Sheen', 'United States', '2003-07-06'),
 ('Sam Sheen', 'United States', '2004-03-09'),
 ('Lola Sheen', 'United States', '2005-06-01'),
 ('Bob Sheen', 'United States', '2009-05-01'),
 ('Max Sheen', 'United States', '2009-05-01')]

We can observe that the youngest alive person  is **Max Sheen**, who was born in 2009-05-01 in United States, while the eldest alive person is **John Williams**, who was born in	United States, in  	1928-08-08.

# How many movies of each genre are there?

Let's try to figure out how many movies each genre have.

In [48]:
%%sql

SELECT COUNT(genre_id), genre_name
FROM tb_genre
INNER JOIN tb_movie
ON movie_genre_id=genre_id
GROUP BY genre_name
ORDER BY COUNT(genre_id) DESC

 * sqlite://
Done.

[(3, 'Comedia'),
 (2, 'Suspense'),
 (2, 'Romance'),
 (2, 'Drama'),
 (2, 'Ciencia Ficción'),
 (2, 'Acción'),
 (1, 'Terror'),
 (1, 'Fantasía'),
 (1, 'Bélico')]

We observe that  the genre of *Comedy* is the genre with more movies in the database, while *War*, *Fantasy*, and *Horror* movies are the less present in the database.

# What is the maximum number of roles performed by each person?

We are going to figure out the name of the person and the maximum number of roles which that person had in a single movie.

In [124]:
%%sql
SELECT DISTINCT p.person_name,  COUNT(m.role_id)
FROM tb_person p
    INNER JOIN 
    tb_movie_person m ON p.person_id=m.person_id
GROUP BY p.person_name, m.role_id
HAVING COUNT(m.role_id)
ORDER BY COUNT(m.role_id) DESC

 * sqlite://
Done.

[('Steven Spielberg', 4),
 ('Emilio Martinez Lazaro', 3),
 ('Harrison Ford', 3),
 ('Carmen Machi', 2),
 ('Clara Lago', 2),
 ('Dani Rovira', 2),
 ('Karra Elejalde', 2),
 ('Alfred Joseph Hitchcock', 1),
 ('Anthony Perkins', 1),
 ('Carmine Coppola', 1),
 ('Catherine Zeta-Jones', 1),
 ('Charlie Sheen', 1),
 ('Daniel Sanchez Arevalo', 1),
 ('Francis Ford Coppola', 1),
 ('Gary Kurtz', 1),
 ('George Lucas', 1),
 ('Hector Colome', 1),
 ('John Williams', 1),
 ('Marlon Brando', 1),
 ('Martin Sheen', 1),
 ('Mel Gibson', 1),
 ('Morgan Freeman', 1),
 ('Patrick Criado', 1),
 ('Quim Gutierrez', 1),
 ('Robert Alamo', 1),
 ('Robert Duvall', 1),
 ('Steven Spielberg', 1),
 ('Tim Robbins', 1),
 ('Tom Hanks', 1),
 ('Vera Miles', 1),
 ('Veronica Echegui', 1)]

We observe that most of the people had a single role in a movie. Only few people had multiple roles in the same movie, as it can be observed in the following table:

In [123]:
%%sql
SELECT DISTINCT p.person_name,  COUNT(m.role_id)
FROM tb_person p
    INNER JOIN 
    tb_movie_person m ON p.person_id=m.person_id
GROUP BY p.person_name, m.role_id
HAVING COUNT(m.role_id)>1
ORDER BY COUNT(m.role_id) DESC

 * sqlite://
Done.

[('Steven Spielberg', 4),
 ('Emilio Martinez Lazaro', 3),
 ('Harrison Ford', 3),
 ('Carmen Machi', 2),
 ('Clara Lago', 2),
 ('Dani Rovira', 2),
 ('Karra Elejalde', 2)]

It is not surpring that *Steven Spielberg*,  one of the most influential personalities in the history of cinema appears in the first place! At the end, one of his most famous quotes is: *The only time I'm totally happy is when I'm watching films or making them*."

# Modifying the database

## Adding a new genre

We are goint to add a new genre, '*Documental*', with a *ID_genre* of 69:

In [125]:
%%sql
INSERT INTO tb_genre (genre_id, genre_name) VALUES ( 69, 'Documental');

 * sqlite://
1 rows affected.

[]

Verification:

In [126]:
%%sql

SELECT * FROM tb_genre

 * sqlite://
Done.

[(1, 'Acción', 'OS_SGAD', None, None),
 (2, 'Ciencia Ficción', 'OS_SGAD', None, None),
 (3, 'Comedia', 'OS_SGAD', None, None),
 (4, 'Drama', 'OS_SGAD', None, None),
 (5, 'Fantasía', 'apermag', None, None),
 (6, 'Melodrama', 'apermag', '2018-09-01', '2018-09-27'),
 (7, 'Musical', 'OS_SGAD', None, None),
 (8, 'Romance', 'OS_SGAD', None, None),
 (9, 'Suspense', 'OS_SGAD', None, None),
 (10, 'Terror', 'OS_SGAD', None, None),
 (11, 'Bélico', 'OS_SGAD', None, None),
 (69, 'Documental', 'OS_SGAD', None, None)]

## Deleting a movie

Let's going to delete the movie *La Gran Familia Española* from the database

In [128]:
%%sql

DELETE FROM tb_movie WHERE movie_title='La Gran Familia Española';

 * sqlite://
1 rows affected.

[]

Verification:

In [132]:
%%sql

SELECT COUNT(movie_title) FROM tb_movie
WHERE movie_title='La Gran Familia Española'

 * sqlite://
Done.

[(0,)]

## Modifying a movie genre

Finally, we are going to modify the genre of "*Ocho apellidos catalanes*" from *Romance* to *Comedy*

In [141]:
%%sql

UPDATE tb_movie
SET movie_genre_id = '3'
WHERE movie_id = 9;

 * sqlite://
1 rows affected.

[]

Let's verify it:

In [142]:
%%sql

SELECT genre_id, genre_name, m.movie_title
FROM tb_genre
INNER JOIN tb_movie m
ON m.movie_genre_id=genre_id
ORDER BY genre_id

 * sqlite://
Done.

[(1, 'Acción', 'Indiana Jones and the Temple of Doom'),
 (1, 'Acción', 'El dia de la bestia'),
 (2, 'Ciencia Ficción', 'Star Wars:Episode IV - A New Hope'),
 (2, 'Ciencia Ficción', 'Blade Runner'),
 (3, 'Comedia', 'The Terminal'),
 (3, 'Comedia', 'Ocho Apellidos Vascos'),
 (3, 'Comedia', 'Ocho Apellidos Catalanes'),
 (4, 'Drama', 'Braveheart'),
 (4, 'Drama', 'The Shawshank Redemption'),
 (5, 'Fantasía', 'ET The Extraterrestrial'),
 (8, 'Romance', 'El otro lado de la cama'),
 (9, 'Suspense', 'Psycho'),
 (9, 'Suspense', 'Las brujas de Zugarramurdi'),
 (10, 'Terror', 'Jaws'),
 (11, 'Bélico', 'Apocalypse Now')]

The modification worked. Now, *Ocho Apellidos Catalanes* belongs to the *Comedy* genre.

# Conclusions

To conclude, an exploratory analysis of the database has been done, as well as the analysis of the data applying different filters in order to figure out who was the eldest person alive or how many different movies are per genre. Finally, we have we have applied some modifications into the database.